# SetPluginStyle

## Description
Set the style to associate with a plug-in object

```pascal
FUNCTION SetPluginStyle(
				hObject   : HANDLE;
				styleName : STRING) : BOOLEAN;
```

```python

def vs.SetPluginStyle(hObject, styleName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE|Handle to a plug-in object.|
|styleName|STRING|Name of style to use|

## Version
Availability: from Vectorworks 2017
## Category
* Objects - Custom